Res-firecracker-random-in4-v8/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5058.219ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 5117.042ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 5073.861ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5104.777ms, rate sampling interval: 17924ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    29.79s    12.04s    0.86m    64.17%
    Req/Sec   267.75      2.17   272.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.15s 
 75.000%   40.47s 
 90.000%   49.02s 
 99.000%    0.86m 
 99.900%    0.87m 
 99.990%    0.87m 
 99.999%    0.87m 
100.000%    0.87m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9912.319     0.000000            2         1.00
   14753.791     0.100000         5375         1.11
   19431.423     0.200000        10753         1.25
   22036.479     0.300000        16160         1.43
   22806.527     0.400000        21549         1.67
   26148.863     0.500000        26866         2.00
   29507.583     0.550000        29549         2.22
   32784.383     0.600000        32235         2.50
   35684.351     0.650000        34927         2.86
   38862.847     0.700000        37620         3.33
   40468.479     0.750000        40287         4.00
   41091.071     0.775000        41640         4.44
   41746.431     0.800000        43015         5.00
   42532.863     0.825000        44311         5.71
   44269.567     0.850000        45666         6.67
   46759.935     0.875000        47002         8.00
   47906.815     0.887500        47678         8.89
   49020.927     0.900000        48356        10.00
   49676.287     0.912500        49041        11.43
   50036.735     0.925000        49705        13.33
   50364.415     0.937500        50411        16.00
   50495.487     0.943750        50761        17.78
   50593.791     0.950000        51025        20.00
   50757.631     0.956250        51390        22.86
   50921.471     0.962500        51752        26.67
   51052.543     0.968750        52080        32.00
   51118.079     0.971875        52203        35.56
   51216.383     0.975000        52418        40.00
   51281.919     0.978125        52544        45.71
   51380.223     0.981250        52742        53.33
   51445.759     0.984375        52885        64.00
   51511.295     0.985938        53018        71.11
   51544.063     0.987500        53073        80.00
   51609.599     0.989062        53177        91.43
   51642.367     0.990625        53224       106.67
   51707.903     0.992188        53292       128.00
   51773.439     0.992969        53351       142.22
   51806.207     0.993750        53380       160.00
   51871.743     0.994531        53439       182.86
   51904.511     0.995313        53467       213.33
   51970.047     0.996094        53511       256.00
   52002.815     0.996484        53531       284.44
   52035.583     0.996875        53546       320.00
   52068.351     0.997266        53566       365.71
   52133.887     0.997656        53598       426.67
   52166.655     0.998047        53617       512.00
   52166.655     0.998242        53617       568.89
   52199.423     0.998437        53647       640.00
   52199.423     0.998633        53647       731.43
   52232.191     0.998828        53658       853.33
   52232.191     0.999023        53658      1024.00
   52264.959     0.999121        53673      1137.78
   52264.959     0.999219        53673      1280.00
   52297.727     0.999316        53689      1462.86
   52297.727     0.999414        53689      1706.67
   52297.727     0.999512        53689      2048.00
   52297.727     0.999561        53689      2275.56
   52330.495     0.999609        53700      2560.00
   52330.495     0.999658        53700      2925.71
   52330.495     0.999707        53700      3413.33
   52330.495     0.999756        53700      4096.00
   52330.495     0.999780        53700      4551.11
   52330.495     0.999805        53700      5120.00
   52363.263     0.999829        53708      5851.43
   52363.263     0.999854        53708      6826.67
   52363.263     0.999878        53708      8192.00
   52363.263     0.999890        53708      9102.22
   52363.263     0.999902        53708     10240.00
   52363.263     0.999915        53708     11702.86
   52363.263     0.999927        53708     13653.33
   52363.263     0.999939        53708     16384.00
   52363.263     0.999945        53708     18204.44
   52363.263     0.999951        53708     20480.00
   52363.263     0.999957        53708     23405.71
   52396.031     0.999963        53710     27306.67
   52396.031     1.000000        53710          inf
#[Mean    =    29786.212, StdDeviation   =    12035.198]
#[Max     =    52363.264, Total count    =        53710]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64010 requests in 1.00m, 26.43MB read
Requests/sec:   1066.83
Transfer/sec:    451.02KB